const text = `  ▄▄▄█████▓ ██░ ██ ▓█████     ▄████▄   ▄▄▄      ▄▄▄█████▓ 
  ▓  ██▒ ▓▒▓██░ ██▒▓█   ▀    ▒██▀ ▀█  ▒████▄    ▓  ██▒ ▓▒ 
  ▒ ▓██░ ▒░▒██▀▀██░▒███      ▒▓█    ▄ ▒██  ▀█▄  ▒ ▓██░ ▒░ 
  ░ ▓██▓ ░ ░▓█ ░██ ▒▓█  ▄    ▒▓▓▄ ▄██▒░██▄▄▄▄██ ░ ▓██▓ ░  
    ▒██▒ ░ ░▓█▒░██▓░▒████▒   ▒ ▓███▀ ░ ▓█   ▓██▒  ▒██▒ ░  
    ▒ ░░    ▒ ░░▒░▒░░ ▒░ ░   ░ ░▒ ▒  ░ ▒▒   ▓▒█░  ▒ ░░    
      ░     ▒ ░▒░ ░ ░ ░  ░     ░  ▒     ▒   ▒▒ ░    ░     
    ░       ░  ░░ ░   ░      ░          ░   ▒     ░       
            ░  ░  ░   ░  ░   ░ ░            ░  ░          
                           ░                              
Welcome to arch  (GNU/Linux 6.19.6-arch1-1)

 System information

  System load:              0.03
  Usage of /:               87.8% of 479.87GB
  Memory usage:             31%
  Swap usage:               14%
  Temperature:              61.0 C
  Processes:                227
  Users logged in:          1
  IPv4 address for enp0s25: 192.168.100.10

  => / is using 87.8% of 479.87GB

*** System restart required ***

Last login: Now from 192.168.1.1
`;

const lines = text.split("\n");
const output = document.getElementById("term");

let i = 0;

function printNextLine() {
  if (i < lines.length) {
    output.innerHTML += lines[i] + "<br>";
    i++;
    setTimeout(printNextLine, 200); // 0.2 seconds
  }
}

printNextLine();